marcelkottmann/esp32-javascript/main/main.cpp
            if (bind(sd, (struct sockaddr *)&server, sizeof(server)) >= 0)
            {
                ESP_LOGD(tag, "Trying to create client socket...\n");

                int sc = createNonBlockingSocket(AF_INET, SOCK_DGRAM, 0, true);

                ESP_LOGD(tag, "Created socket pair: %d<-->%d\n", sd, sc);

                ESP_LOGD(tag, "Send test data...\n");

                memset((char *)&target, 0, sizeof(target));
                target.sin_family = AF_INET;
                target.sin_port = htons(port);
                target.sin_len = sizeof(target);
                inet_pton(AF_INET, "127.0.0.1", &(target.sin_addr));

                if (sendto(sc, "", 1, 0, (const sockaddr *)&target, sizeof(target)) < 0)
                {
                    ESP_LOGE(tag, "Error sending test data to self-socket: %d\n", errno);
                }
                else
                {
                    ESP_LOGD(tag, "Trying to receive test data...\n");
                    char msg[2] = "A";
                    struct sockaddr_in remaddr;
                    socklen_t addrlen = sizeof(remaddr);

                    int result = 0;
                    while ((result = recvfrom(sd, msg, 1, 0, (struct sockaddr *)&remaddr, &addrlen)) < 0 && errno == EAGAIN)
                    {
                    }

                    while (result < 0)
                    {
                        ESP_LOGE(tag, "Error receiving test data from self-socket: %d\n", errno);
                    }
                    ESP_LOGD(tag, "Finished reading.\n");

                    if (strcmp(msg, "") == 0)
                    {
                        ESP_LOGI(tag, "Self-Socket Test successful!\n");

                        selectClientSocket = sc;
                        selectServerSocket = sd;
                        ESP_LOGD(tag, "Successfully created socket pair: %d<-->%d\n", selectServerSocket, selectClientSocket);
                        return 0;
                    }
                    else
                    {
                        ESP_LOGE(tag, "Self-socket test NOT successful: %s\n", msg);
                    }
                }
                close(sc);
            }
            else
            {
                ESP_LOGE(tag, "Binding self-socket was unsuccessful: %d\n", errno);
            }

            close(sd);
        }
        else
        {
            ESP_LOGE(tag, "Self-socket could not be created: %d", errno);
        }
    }
    else
    {
        ESP_LOGD(tag, "Skip until wifi connected: %d\n", errno);
    }

    ESP_LOGD(tag, "Could not create socket pair... no wifi?\n");
    return -1;
}

void select_task_it()
{

    // create socket pair
    if (selectServerSocket < 0)
    {
        createSocketPair();
    }

    if (selectServerSocket >= 0 && (notConnectedSockets_len + connectedSockets_len) > 0)
    {
        fd_set readset;
        fd_set writeset;
        fd_set errset;

        int sockfd_max = -1;
        FD_ZERO(&readset);
        FD_ZERO(&writeset);
        FD_ZERO(&errset);

        //register not connected sockets for write ready event
        for (int i = 0; i < notConnectedSockets_len; i++)
        {
            int sockfd = notConnectedSockets[i];
            FD_SET(sockfd, &writeset);
            FD_SET(sockfd, &errset);
            if (sockfd > sockfd_max)
            {
                sockfd_max = sockfd;
            }
        }

        //register connected sockets for read ready event
        for (int i = 0; i < connectedSockets_len; i++)
        {
            int sockfd = connectedSockets[i];
            FD_SET(sockfd, &readset);
            FD_SET(sockfd, &errset);
            if (sockfd > sockfd_max)
            {
                sockfd_max = sockfd;
            }
        }

        //set self-socket flag
        //reset (read all data) from self socket
        int dataAvailable;
        if (lwip_ioctl(selectServerSocket, FIONREAD, &dataAvailable) < 0)
        {
            ESP_LOGE(tag, "Error getting data available from self-socket: %d.", errno);
        }
        ESP_LOGD(tag, "DATA AVAILABLE %d.\n", dataAvailable);
        //read self-socket if flag is set
        if (dataAvailable > 0)
        {
            char msg[dataAvailable];
            struct sockaddr_in remaddr;
            socklen_t addrlen = sizeof(remaddr);
            if (recvfrom(selectServerSocket, msg, dataAvailable, 0, (struct sockaddr *)&remaddr, &addrlen) < 0)
            {
                ESP_LOGE(tag, "READ self-socket FAILED: %d\n", errno);
            }
            else
            {
                ESP_LOGD(tag, "READ of self-socket.\n");
            }
        }

        FD_SET(selectServerSocket, &readset);
        if (selectServerSocket > sockfd_max)
        {
            sockfd_max = selectServerSocket;
        }
        // self socket end
        int ret = select(sockfd_max + 1, &readset, &writeset, &errset, NULL);
        needsUnblock = true;
        ESP_LOGD(tag, "Select return %d.\n", ret);
        if (ret >= 0)
        {
            if (ret > 0)
            {
                eventlist_t events;
                events.events_len = 0;

                for (int i = 0; i < notConnectedSockets_len; i++)
                {
                    int sockfd = notConnectedSockets[i];
                    if (FD_ISSET(sockfd, &errset))
                    {
                        timer_event_t event;
                        el_create_event(&event, EL_SOCKET_EVENT_TYPE, EL_SOCKET_STATUS_ERROR, sockfd);
                        el_add_event(&events, &event);
                    }
                    else if (FD_ISSET(sockfd, &writeset))
                    {
                        timer_event_t event;
                        el_create_event(&event, EL_SOCKET_EVENT_TYPE, EL_SOCKET_STATUS_WRITE, sockfd);
                        el_add_event(&events, &event);
                    }
                }
                for (int i = 0; i < connectedSockets_len; i++)
                {
                    int sockfd = connectedSockets[i];
                    if (FD_ISSET(sockfd, &errset))
                    {
                        timer_event_t event;
                        el_create_event(&event, EL_SOCKET_EVENT_TYPE, EL_SOCKET_STATUS_ERROR, sockfd);
                        el_add_event(&events, &event);
                    }
                    else if (FD_ISSET(sockfd, &readset))
                    {
                        timer_event_t event;
                        el_create_event(&event, EL_SOCKET_EVENT_TYPE, EL_SOCKET_STATUS_READ, sockfd);
                        el_add_event(&events, &event);
                    }
                }

