marcelkottmann/esp32-javascript/main/main.cpp
                if (events.events_len > 0)
                {
                    ESP_LOGD(tag, "Fire all %d socket events!\n", events.events_len);
                    el_fire_events(&events);
                }
                else
                {
                    ESP_LOGD(tag, "No socket events to fire!\n");
                }
            }
        }
        else
        {
            ESP_LOGE(tag, "select returns ERROR: %d\n", errno);
        }
    }
    //wait for next loop
    needsUnblock = true;
    ESP_LOGD(tag, "Select loop finished and now waits for next iteration.\n");
    xSemaphoreTake(xSemaphore, portMAX_DELAY);
    needsUnblock = false;
}

void select_task(void *ignore)
{
    ESP_LOGD(tag, "Starting select task...\n");

    while (true)
    {
        ESP_LOGD(tag, "Starting next select loop.\n");
        select_task_it();
    }
}

void startSelectTask()
{
    xTaskCreatePinnedToCore(&select_task, "select_task", 12 * 1024, NULL, 5, &stask, 1);
}

static duk_ret_t el_load(duk_context *ctx)
{
    int ret = 0;
    esp_err_t err;

    const char *key = duk_to_string(ctx, 0);

    nvs_handle my_handle;
    err = nvs_open("storage", NVS_READONLY, &my_handle);
    if (err != ESP_OK)
    {
        ESP_LOGE(tag, "Error (%d) opening NVS!\n", err);
        return -1;
    }

    size_t string_size;
    err = nvs_get_str(my_handle, key, NULL, &string_size);
    if (err != ESP_OK)
    {
        ESP_LOGE(tag, "Cannot get key %s from storage, err=%d\n", key, err);
        ret = -1;
    }
    else
    {
        char *value = (char *)malloc(string_size);
        err = nvs_get_str(my_handle, key, value, &string_size);
        if (err != ESP_OK)
        {
            ESP_LOGE(tag, "Cannot get key %s from storage, err=%d\n", key, err);
            ret = -1;
        }
        else
        {
            duk_push_string(ctx, value);
            ret = 1;
        }
        free(value);
    }
    nvs_close(my_handle);
    return ret;
}

static duk_ret_t el_store(duk_context *ctx)
{
    int ret = 0;
    esp_err_t err;

    const char *key = duk_to_string(ctx, 0);
    if (strlen(key) > 15)
    {
        ESP_LOGE(tag, "Keys may not be longer than 15 chars. Key '%s' is longer.\n", key);
        return -1;
    }

    const char *value = duk_to_string(ctx, 1);
    int len = strlen(value);
    if (len > (1984 - 1))
    {
        ESP_LOGE(tag, "Values may not be longer than 1984 chars (including zero-termination). Current string length is %d\n", len);
        return -1;
    }

    ESP_LOGD(tag, "Opening Non-Volatile Storage (NVS) ... ");
    nvs_handle my_handle;
    err = nvs_open("storage", NVS_READWRITE, &my_handle);
    if (err != ESP_OK)
    {
        ESP_LOGE(tag, "Error (%d) opening NVS!\n", err);
        return -1;
    }

    err = nvs_set_str(my_handle, key, value);
    if (err != ESP_OK)
    {
        ESP_LOGE(tag, "Cannot set key %s and value %s from storage, err=%d\n", key, value, err);
        ret = -1;
    }

    err = nvs_commit(my_handle);
    if (err != ESP_OK)
    {
        ESP_LOGE(tag, "Cannot commit changes, err=%d\n", err);
        ret = -1;
    }
    nvs_close(my_handle);
    return ret;
}

static duk_ret_t el_registerSocketEvents(duk_context *ctx)
{
    int c_len, nc_len;
    int *c_sockfds;
    int *nc_sockfds;

    //not connected sockets
    if (duk_is_array(ctx, 0))
    {
        nc_len = duk_get_length(ctx, 0);
        nc_sockfds = (int *)calloc(nc_len, sizeof(int));
        for (int i = 0; i < nc_len; i++)
        {
            duk_get_prop_index(ctx, 0, i);
            nc_sockfds[i] = duk_to_int(ctx, -1);
            duk_pop(ctx);
        }
    }
    else
    {
        //error
        return -1;
    }

    //connected sockets
    if (duk_is_array(ctx, 1))
    {
        c_len = duk_get_length(ctx, 1);
        c_sockfds = (int *)calloc(c_len, sizeof(int));
        for (int i = 0; i < c_len; i++)
        {
            duk_get_prop_index(ctx, 1, i);
            c_sockfds[i] = duk_to_int(ctx, -1);
            duk_pop(ctx);
        }
    }
    else
    {
        //error
        return -1;
    }

    //check if there are changes between this and the previous call
    bool changes = c_len != connectedSockets_len || nc_len != notConnectedSockets_len;
    //deep check
    if (!changes)
    {
        for (int i = 0; i < nc_len; i++)
        {
            if (notConnectedSockets[i] != nc_sockfds[i])
            {
                changes = true;
                break;
            }
        }
        if (!changes)
        {
            for (int i = 0; i < c_len; i++)
            {
                if (connectedSockets[i] != c_sockfds[i])
                {
                    changes = true;
                    break;
                }
            }
        }
    }

    if (changes)
    {
        //swap
        free(notConnectedSockets);
        notConnectedSockets_len = nc_len;
        notConnectedSockets = nc_sockfds;

        free(connectedSockets);
        connectedSockets_len = c_len;
        connectedSockets = c_sockfds;
    }
    else
    {
        free(nc_sockfds);
        free(c_sockfds);
    }

    if (changes)
    {
        ESP_LOGD(tag, "Trying to trigger the next select iteration... ");
        if (selectClientSocket >= 0)
        {
            //interrupt select through self-socket
            ESP_LOGD(tag, "Sending . to self-socket.");
            needsUnblock = true;
            if (sendto(selectClientSocket, ".", 1, 0, (const sockaddr *)&target, sizeof(target)) < 0)
            {
                ESP_LOGE(tag, "Self-socket sending was NOT successful: %d\n", errno);
            }
            else
            {
                ESP_LOGD(tag, "Self-socket sending was successful.\n");
            }
        }
    }

    //trigger next select loop
    if (needsUnblock)
    {
        xSemaphoreGive(xSemaphore);
    }

    return 0;
}

static duk_ret_t el_createNonBlockingSocket(duk_context *ctx)
{
    int sockfd = createNonBlockingSocket(AF_INET, SOCK_STREAM, IPPROTO_TCP, true);

    duk_push_int(ctx, sockfd);
    return 1;
}

static duk_ret_t el_connectNonBlocking(duk_context *ctx)
{
    int sockfd = duk_to_int(ctx, 0);
    const char *hostname = duk_to_string(ctx, 1);
    int port = duk_to_int(ctx, 2);

