marcelkottmann/esp32-javascript/main/main.cpp
    int ret = connectNonBlocking(sockfd, hostname, port);
    duk_push_int(ctx, ret);
    return 1;
}

static duk_ret_t el_bindAndListen(duk_context *ctx)
{
    int sockfd = duk_to_int(ctx, 0);
    int port = duk_to_int(ctx, 1);

    int ret = bindAndListen(sockfd, port);
    duk_push_int(ctx, ret);
    return 1;
}

static duk_ret_t el_acceptIncoming(duk_context *ctx)
{
    int sockfd = duk_to_int(ctx, 0);

    int ret = acceptIncoming(sockfd);
    if (ret < 0 && errno == EAGAIN)
    {
        //return undefined
        return 0;
    }

    duk_push_int(ctx, ret);
    return 1;
}

static duk_ret_t el_closeSocket(duk_context *ctx)
{
    int socketfd = duk_to_int(ctx, 0);
    closeSocket(socketfd);
    return 0;
}

static duk_ret_t getSocketStatus(duk_context *ctx)
{
    fd_set readset;
    fd_set writeset;
    fd_set errset;

    int socketfd = duk_to_int(ctx, 0);

    int socketfds_len = 1;
    int socketfds[socketfds_len];
    socketfds[0] = socketfd;

    int ret = checkSockets(socketfds, socketfds_len, &readset, &writeset, &errset);
    if (ret >= 0)
    {
        int sockfd = socketfds[0];
        duk_idx_t obj_idx = duk_push_object(ctx);
        duk_push_boolean(ctx, FD_ISSET(sockfd, &readset));
        duk_put_prop_string(ctx, obj_idx, "readable");
        duk_push_boolean(ctx, FD_ISSET(sockfd, &writeset));
        duk_put_prop_string(ctx, obj_idx, "writable");
        duk_push_boolean(ctx, FD_ISSET(sockfd, &errset));
        duk_put_prop_string(ctx, obj_idx, "error");
    }
    else
    {
        duk_idx_t obj_idx = duk_push_object(ctx);
        duk_push_boolean(ctx, true);
        duk_put_prop_string(ctx, obj_idx, "error");
        duk_push_int(ctx, errno);
        duk_put_prop_string(ctx, obj_idx, "errno");
    }
    return 1;
}

static duk_ret_t writeSocket_bind(duk_context *ctx)
{
    int sockfd = duk_to_int(ctx, 0);
    const char *msg = duk_to_string(ctx, 1);

    int ret = writeSocket(sockfd, msg);

    duk_push_int(ctx, ret);
    return 1;
}

static duk_ret_t el_readSocket(duk_context *ctx)
{
    int sockfd = duk_to_int(ctx, 0);

    int len = 1024;
    char msg[len];

    int ret = readSocket(sockfd, (char *)msg, len - 1);
    if (ret >= 0)
    {
        msg[ret] = '\0';
        duk_push_string(ctx, msg);
    }
    else if (errno == EAGAIN)
    {
        printf("******************************\n");
        printf("* EAGAIN RETURNED!!!         *\n");
        printf("******************************\n");

        //eagain
        duk_push_undefined(ctx);
    }
    else
    {
        //error
        duk_push_null(ctx);
    }
    return 1;
}

static duk_ret_t el_stopWifi(duk_context *ctx)
{
    esp_wifi_stop();
    return 0;
}

static duk_ret_t el_startWifi(duk_context *ctx)
{
    esp_wifi_start();
    return 0;
}

static duk_ret_t setupWifi(duk_context *ctx, bool softap)
{
    const char *ssid = duk_to_string(ctx, 0);
    const char *pass = duk_to_string(ctx, 1);

    //try stopping
    esp_wifi_stop();

    wifi_init_config_t cfg = WIFI_INIT_CONFIG_DEFAULT();
    ESP_ERROR_CHECK(esp_wifi_init(&cfg));
    //ESP_ERROR_CHECK(esp_wifi_set_ps(WIFI_PS_MODEM));

    ESP_ERROR_CHECK(esp_wifi_set_storage(WIFI_STORAGE_RAM));
    if (softap)
    {
        ESP_ERROR_CHECK(esp_wifi_set_mode(WIFI_MODE_AP));
        wifi_config_t ap_config;
        ap_config.ap.ssid_len = 0;
        ap_config.ap.channel = 1;
        ap_config.ap.authmode = strlen(pass) > 0 ? WIFI_AUTH_WPA2_PSK : WIFI_AUTH_OPEN;
        ap_config.ap.ssid_hidden = false;
        ap_config.ap.max_connection = 10;
        ap_config.ap.beacon_interval = 100;

        strcpy((char *)ap_config.ap.ssid, ssid);
        strcpy((char *)ap_config.ap.password, "");
        ESP_ERROR_CHECK(esp_wifi_set_config(WIFI_IF_AP, &ap_config));
    }
    else
    {
        wifi_config_t wifi_config = {
            .sta = {},
        };
        strcpy((char *)wifi_config.sta.ssid, ssid);
        strcpy((char *)wifi_config.sta.password, pass);

        ESP_LOGD(tag, "Setting WiFi configuration SSID %s and PASS %s ...", wifi_config.sta.ssid, wifi_config.sta.password);
        ESP_ERROR_CHECK(esp_wifi_set_mode(WIFI_MODE_STA));
        ESP_ERROR_CHECK(esp_wifi_set_config(WIFI_IF_STA, &wifi_config));
    }
    ESP_ERROR_CHECK(esp_wifi_start());
    return 0;
}

static duk_ret_t el_connectWifi(duk_context *ctx)
{
    return setupWifi(ctx, false);
}

static duk_ret_t el_createSoftAp(duk_context *ctx)
{
    return setupWifi(ctx, true);
}

static duk_ret_t native_print(duk_context *ctx)
{
    printf("%s\n", duk_to_string(ctx, 0));
    return 0; /* no return value (= undefined) */
}

static duk_ret_t native_delay(duk_context *ctx)
{
    int delay = duk_to_int32(ctx, 0);
    ESP_LOGD(tag, "Waiting %dms...\n", delay);
    if (delay < 0)
    {
        delay = 0;
    }
    vTaskDelay(delay / portTICK_PERIOD_MS);
    return 0;
}

static duk_ret_t el_install_timer(duk_context *ctx)
{
    int delay = duk_to_int32(ctx, 0);

    //delay = delay / 600;

    int handle = duk_to_int32(ctx, 1);
    if (delay < 0)
    {
        delay = 0;
    }
    ESP_LOGD(tag, "Install timer to notify in  %dms.\n", delay);
    init_timer(delay, handle);
    return 0;
}

static duk_ret_t el_suspend(duk_context *ctx)
{
    eventlist_t events;

    ESP_LOGD(tag, "Waiting for events...\n");

    xQueueReceive(el_event_queue, &events, portMAX_DELAY);

    ESP_LOGD(tag, "Receiving %d events.\n", events.events_len);

    int arr_idx = duk_push_array(ctx);
    for (int i = 0; i < events.events_len; i++)
    {
        duk_idx_t obj_idx = duk_push_object(ctx);

        duk_push_int(ctx, events.events[i].type);
        duk_put_prop_string(ctx, obj_idx, "type");
        duk_push_int(ctx, events.events[i].status);
        duk_put_prop_string(ctx, obj_idx, "status");
        duk_push_int(ctx, events.events[i].fd);
        duk_put_prop_string(ctx, obj_idx, "fd");

        duk_put_prop_index(ctx, arr_idx, i);
    }

    return 1;
}

static duk_ret_t el_pinMode(duk_context *ctx)
{
    int pin = duk_to_int(ctx, 0);
    int dir = duk_to_int(ctx, 1);

    ESP_LOGD(tag, "el_pinMode pin=%d dir=%d\n", pin, dir);

    pinMode(pin, dir);
    return 0;
}

static duk_ret_t el_digitalWrite(duk_context *ctx)
{
    int pin = duk_to_int(ctx, 0);
    int level = duk_to_int(ctx, 1);

    ESP_LOGD(tag, "el_digitalWrite pin=%d level=%d\n", pin, level);

    digitalWrite(pin, level);
    return 0;
}

static duk_ret_t el_digitalRead(duk_context *ctx)
{
    int pin = duk_to_int(ctx, 0);

    ESP_LOGD(tag, "el_digitalRead pin=%d\n", pin);

    int val = digitalRead(pin);
    duk_push_int(ctx, val);
    return 1;
}

static duk_ret_t el_ledcSetup(duk_context *ctx)
{
    int channel = duk_to_int(ctx, 0);
    int freq = duk_to_int(ctx, 1);
    int resolution = duk_to_int(ctx, 2);

    ESP_LOGD(tag, "el_ledcSetup channel=%d freq=%d resolution=%d \n", channel, freq, resolution);

