marcelkottmann/esp32-javascript/main/main.cpp
    ledcSetup(channel, freq, resolution);
    return 0;
}

static duk_ret_t el_ledcAttachPin(duk_context *ctx)
{
    int pin = duk_to_int(ctx, 0);
    int channel = duk_to_int(ctx, 1);

    ESP_LOGD(tag, "el_ledcAttachPin pin=%d channel=%d\n", pin, channel);

    ledcAttachPin(pin, channel);
    return 0;
}

static duk_ret_t el_ledcWrite(duk_context *ctx)
{
    int channel = duk_to_int(ctx, 0);
    int dutyCycle = duk_to_int(ctx, 1);

    ESP_LOGD(tag, "el_ledcWrite channel=%d dutyCycle=%d \n", channel, dutyCycle);

    ledcWrite(channel, dutyCycle);
    return 0;
}

static duk_ret_t info(duk_context *ctx)
{
    printf("ESP32 SDK version:%s, RAM left %d\n", system_get_sdk_version(), system_get_free_heap_size());
    return 0;
}

rgbVal *pixels = NULL;
int NUM_PIXELS = 8;

static duk_ret_t setLedColor(duk_context *ctx)
{
    int num = duk_to_int(ctx, 0);
    int r = duk_to_int(ctx, 1);
    int g = duk_to_int(ctx, 2);
    int b = duk_to_int(ctx, 3);

    if (pixels == NULL)
    {
        if (ws2812_init(18, LED_WS2812B))
        {
            ESP_LOGE(tag, "Init FAILURE: halting");
            //error
            return -1;
        }

        pixels = (rgbVal *)malloc(sizeof(rgbVal) * NUM_PIXELS);
        for (int i = 0; i < NUM_PIXELS; i++)
        {
            pixels[i] = makeRGBVal(0, 0, 0);
        }
    }
    //    printf("Values: %d,%d,%d,%d\n", num, r, g, b);
    pixels[num] = makeRGBVal(r, g, b);
    ws2812_setColors(NUM_PIXELS, pixels);

    return 0;
}

static duk_ret_t el_restart(duk_context *ctx)
{
    esp_restart();
    return 0;
}

static void my_fatal(void *udata, const char *msg)
{
    (void)udata; /* ignored in this case, silence warning */

    /* Note that 'msg' may be NULL. */
    ESP_LOGE(tag, "*** FATAL ERROR: %s\n", (msg ? msg : "no message"));
    abort();
}

void loadConfig(duk_context *ctx)
{
    char config_js[] = {
#include "boot-js/config.hex"
    };
    ESP_LOGI(tag, "Loading config...\n");
    duk_eval_string_noresult(ctx, config_js);
}

void loadHttp(duk_context *ctx)
{
    char http_js[] = {
#include "boot-js/http.hex"
    };
    ESP_LOGI(tag, "Loading http function...\n");
    duk_eval_string_noresult(ctx, http_js);
}

void loadConfigserver(duk_context *ctx)
{
    char boot_js[] = {
#include "boot-js/configserver.hex"
    };
    ESP_LOGI(tag, "Loading config server function...\n");
    duk_eval_string_noresult(ctx, boot_js);
}

void loadMain(duk_context *ctx)
{
    char boot_js[] = {
#include "boot-js/boot.hex"
    };
    ESP_LOGI(tag, "Loading boot function...\n");
    duk_eval_string_noresult(ctx, boot_js);
}

void loadEventloop(duk_context *ctx)
{
    char eventloop_js[] = {
#include "boot-js/eventloop.hex"
    };
    ESP_LOGI(tag, "Loading and starting event loop...\n");
    duk_eval_string_noresult(ctx, eventloop_js);
}

void duktape_task(void *ignore)
{
    esp_log_level_set(tag, ESP_LOG_DEBUG);
    duk_context *ctx = duk_create_heap(NULL, NULL, NULL, NULL, my_fatal);

    duk_push_c_function(ctx, native_print, 1 /*nargs*/);
    duk_put_global_string(ctx, "print");

    duk_push_int(ctx, INPUT);
    duk_put_global_string(ctx, "INPUT");

    duk_push_int(ctx, OUTPUT);
    duk_put_global_string(ctx, "OUTPUT");

    duk_push_int(ctx, KEY_BUILTIN);
    duk_put_global_string(ctx, "KEY_BUILTIN");

    duk_push_int(ctx, LED_BUILTIN);
    duk_put_global_string(ctx, "LED_BUILTIN");

    duk_push_c_function(ctx, el_pinMode, 2 /*nargs*/);
    duk_put_global_string(ctx, "pinMode");

    duk_push_c_function(ctx, el_digitalRead, 1 /*nargs*/);
    duk_put_global_string(ctx, "digitalRead");

    duk_push_c_function(ctx, el_digitalWrite, 2 /*nargs*/);
    duk_put_global_string(ctx, "digitalWrite");

    duk_push_int(ctx, 1);
    duk_put_global_string(ctx, "HIGH");

    duk_push_int(ctx, 0);
    duk_put_global_string(ctx, "LOW");

    duk_push_c_function(ctx, info, 0 /*nargs*/);
    duk_put_global_string(ctx, "info");

    duk_push_c_function(ctx, getSocketStatus, 1 /*nargs*/);
    duk_put_global_string(ctx, "getSocketStatus");

    duk_push_c_function(ctx, native_delay, 1 /*nargs*/);
    duk_put_global_string(ctx, "delay");

    duk_push_c_function(ctx, writeSocket_bind, 2 /*nargs*/);
    duk_put_global_string(ctx, "writeSocket");

    duk_push_c_function(ctx, el_readSocket, 1 /*nargs*/);
    duk_put_global_string(ctx, "readSocket");

    duk_push_c_function(ctx, el_closeSocket, 1 /*nargs*/);
    duk_put_global_string(ctx, "el_closeSocket");

    // internal functions. use on your own risk:

    duk_push_c_function(ctx, el_suspend, 1 /*nargs*/);
    duk_put_global_string(ctx, "el_suspend");

    duk_push_c_function(ctx, el_install_timer, 2 /*nargs*/);
    duk_put_global_string(ctx, "el_install_timer");

    duk_push_c_function(ctx, el_connectWifi, 2 /*nargs*/);
    duk_put_global_string(ctx, "el_connectWifi");

    duk_push_c_function(ctx, el_createSoftAp, 2 /*nargs*/);
    duk_put_global_string(ctx, "el_createSoftAp");

    duk_push_c_function(ctx, el_createNonBlockingSocket, 0 /*nargs*/);
    duk_put_global_string(ctx, "el_createNonBlockingSocket");

    duk_push_c_function(ctx, el_connectNonBlocking, 3 /*nargs*/);
    duk_put_global_string(ctx, "el_connectNonBlocking");

    duk_push_c_function(ctx, el_bindAndListen, 2 /*nargs*/);
    duk_put_global_string(ctx, "el_bindAndListen");

    duk_push_c_function(ctx, el_acceptIncoming, 1 /*nargs*/);
    duk_put_global_string(ctx, "el_acceptIncoming");

    duk_push_c_function(ctx, el_registerSocketEvents, 2 /*nargs*/);
    duk_put_global_string(ctx, "el_registerSocketEvents");

    duk_push_c_function(ctx, el_load, 1 /*nargs*/);
    duk_put_global_string(ctx, "el_load");

    duk_push_c_function(ctx, el_store, 2 /*nargs*/);
    duk_put_global_string(ctx, "el_store");

    duk_push_c_function(ctx, setLedColor, 4 /*nargs*/);
    duk_put_global_string(ctx, "setLedColor");

    duk_push_c_function(ctx, el_restart, 0 /*nargs*/);
    duk_put_global_string(ctx, "restart");

    duk_push_c_function(ctx, el_stopWifi, 0 /*nargs*/);
    duk_put_global_string(ctx, "stopWifi");

    duk_push_c_function(ctx, el_startWifi, 0 /*nargs*/);
    duk_put_global_string(ctx, "startWifi");

    duk_push_c_function(ctx, el_ledcSetup, 3 /*nargs*/);
    duk_put_global_string(ctx, "ledcSetup");

    duk_push_c_function(ctx, el_ledcAttachPin, 2 /*nargs*/);
    duk_put_global_string(ctx, "ledcAttachPin");

    duk_push_c_function(ctx, el_ledcWrite, 2 /*nargs*/);
    duk_put_global_string(ctx, "ledcWrite");

    loadHttp(ctx);

    loadConfig(ctx);

    loadConfigserver(ctx);

    loadMain(ctx);

    loadEventloop(ctx);

    ESP_LOGI(tag, "Reaching end of event loop.\n");

    //Return from task is not allowed
    vTaskDelete(NULL);
}

extern "C" int app_main()
{
    nvs_flash_init();
    tcpip_adapter_init();
    wifi_event_group = xEventGroupCreate();
    ESP_ERROR_CHECK(esp_event_loop_init(event_handler, NULL));

    el_event_queue = xQueueCreate(10, sizeof(eventlist_t));
    xSemaphore = xSemaphoreCreateBinary();
    startSelectTask();

    xTaskCreatePinnedToCore(&duktape_task, "duktape_task", 20 * 1024, NULL, 5, &task, 0);
    return 0;
}

/*
void app_main()
{
    while (true)
    {
        uint8_t in;
        STATUS s = uart_rx_one_char(&in);
        if (s == OK)
        {
            printf("%c", in);
        }
        portYIELD();
    }
}
*/